hooses_api/app/controllers/houses_controller.rb

  def create
    house = House.create(house_params)
---
INSERT INTO "houses" ("address", "post_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", "72 Netherby Road"], ["post_code", "EH5 3LX"], ["created_at", "2017-05-13 11:18:23.397529"], ["updated_at", "2017-05-13 11:18:23.397529"]]

  def update
    house = House.find(params[:id])
    house.update_attributes(house_params)
---
UPDATE "houses" SET "address" = $1, "post_code" = $2, "updated_at" = $3 WHERE "houses"."id" = $4  [["address", "test address change"], ["post_code", "EH44444"], ["updated_at", "2017-05-13 11:21:39.114939"], ["id", 7]]