hooses_api/app/controllers/messages_controller.rb

  def create
    message = Message.create(message_params)
---
INSERT INTO "messages" ("topic_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic_id", 10], ["user_id", 8], ["content", "test adding a message"], ["created_at", "2017-05-14 10:15:54.346142"], ["updated_at", "2017-05-14 10:15:54.346142"]]

  def update
    message = Message.find(params[:id])
    message.update_attributes(message_params)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "messages" SET "content" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["content", "changing the message content"], ["updated_at", "2017-05-14 10:18:05.695322"], ["id", 16]]

  def destroy
    message = Message.find(params[:id])
    message.destroy!
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 16]]