hooses_api/app/controllers/owner_groups_controller.rb

  def show_houses
    houses = OwnerGroup.where({:user_id => params[:id]})
---
SELECT "owner_groups".* FROM "owner_groups" WHERE "owner_groups"."user_id" = $1  [["user_id", 14]]

  def show_users
    users = OwnerGroup.where({:house_id => params[:id]})
---
SELECT "owner_groups".* FROM "owner_groups" WHERE "owner_groups"."house_id" = $1  [["house_id", 12]]

  def create
    user = User.find(params[:user_id])
    house = House.find(params[:house_id])

    OwnerGroup.create({user: user, house: house})

    user_houses = OwnerGroup.where({:user_id => params[:user_id]})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "owner_groups" ("user_id", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["house_id", 10], ["created_at", "2017-05-13 11:27:57.792684"], ["updated_at", "2017-05-13 11:27:57.792684"]]
SELECT "owner_groups".* FROM "owner_groups" WHERE "owner_groups"."user_id" = $1  [["user_id", 7]]

  def destroy
    owner_group = OwnerGroup.find(params[:id])
    user = owner_group.user
    user_houses = OwnerGroup.where({:user_id => user.id})
    owner_group.destroy!
---
SELECT  "owner_groups".* FROM "owner_groups" WHERE "owner_groups"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "owner_groups".* FROM "owner_groups" WHERE "owner_groups"."user_id" = $1  [["user_id", 7]]
DELETE FROM "owner_groups" WHERE "owner_groups"."id" = $1  [["id", 13]]