hooses_api/app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."house_id" = $1  [["house_id", 16]]
---
def index
topics = Topic.where({
  house_id: params[:house_id]
  })

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    topic = Topic.find(params[:id])

INSERT INTO "topics" ("user_id", "house_id", "title", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 7], ["house_id", 8], ["title", "leaky pipe part 2"], ["status", "urgent"], ["created_at", "2017-05-14 09:37:23.370316"], ["updated_at", "2017-05-14 09:37:23.370316"]]
---
  def create
    topic = Topic.create({
      user_id: params[:user_id],
      house_id: params[:house_id],
      title: params[:title],
      ## maybe we want to mark status as 'open' on default?
      status: params[:status]
    })

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "topics" SET "title" = $1, "status" = $2, "updated_at" = $3 WHERE "topics"."id" = $4  [["title", "test change title"], ["status", "open"], ["updated_at", "2017-05-14 09:46:36.002537"], ["id", 13]]
---
  def update
    topic = Topic.find(params[:id])
    topic.update_attributes(topic_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 13]]
---
  def destroy
    topic = Topic.find(params[:id])
    topic.destroy!