hooses_api/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def show
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
INSERT INTO "profiles" ("first_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "test"], ["user_id", 1], ["created_at", "2017-05-13 10:52:46.121435"], ["updated_at", "2017-05-13 10:52:46.121435"]]
---
  def create_profile
    user = User.find(params[:id])
    user_profiles = user.profiles

    ## ENSURES A PROFILE IS ONLY CREATE IF THEY DON'T HAVE ONE ALREADY
    if user_profiles.length == 0

      profile = Profile.create({
        user: user,
        first_name: params[:first_name],
        last_name: params[:last_name],
        address: params[:address],
        image: params[:image]
        })

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
UPDATE "profiles" SET "address" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["address", "15 High Street"], ["updated_at", "2017-05-13 11:08:16.039344"], ["id", 12]]
---
  def edit_profile
    user = User.find(params[:id])
    user_profile = user.profiles.first

    user_profile.update_attribute(:first_name, params[:first_name])